hiperiondev/esp32idf_APRS/main/app_config.c
// Emit a number: integers without a decimal point, non-integers at the
// shortest precision that still round-trips (mirrors cJSON's number printer
// closely enough that reload via cJSON_Parse yields the same double).
static void jw_num_val(jw_t *w, double v) {
    if (!isfinite(v)) {
        fputs("0", w->f);
        return;
    }
    if (floor(v) == v && fabs(v) < 1e15) {
        fprintf(w->f, "%.0f", v);
        return;
    }
    char tmp[32];
    for (int prec = 7; prec <= 17; prec++) {
        snprintf(tmp, sizeof(tmp), "%.*g", prec, v);
        if (strtod(tmp, NULL) == v)
            break;
    }
    fputs(tmp, w->f);
}

static void jw_key(jw_t *w, const char *k) {
    if (w->obj_comma)
        fputc(',', w->f);
    w->obj_comma = true;
    json_write_escaped(w->f, k);
    fputc(':', w->f);
}

// Object members. The jadd_*(d, "key", value) call signature is what the
// hundreds of call sites below are written against.
static void jadd_str(jw_t *o, const char *k, const char *v) {
    jw_key(o, k);
    json_write_escaped(o->f, v ? v : "");
}
static void jadd_num(jw_t *o, const char *k, double v) {
    jw_key(o, k);
    jw_num_val(o, v);
}
static void jadd_bool(jw_t *o, const char *k, bool v) {
    jw_key(o, k);
    fputs(v ? "true" : "false", o->f);
}

// Scalar arrays: every array written by config_write_json() holds strings,
// numbers or booleans, so those are the three element writers this needs.
static void jarr_begin(jw_t *o, const char *k) {
    jw_key(o, k);
    fputc('[', o->f);
    o->arr_comma = false;
}
static void jarr_end(jw_t *o) {
    fputc(']', o->f);
}
static void jarr_str(jw_t *o, const char *v) {
    if (o->arr_comma)
        fputc(',', o->f);
    o->arr_comma = true;
    json_write_escaped(o->f, v ? v : "");
}
static void jarr_num(jw_t *o, double v) {
    if (o->arr_comma)
        fputc(',', o->f);
    o->arr_comma = true;
    jw_num_val(o, v);
}
static void jarr_bool(jw_t *o, bool v) {
    if (o->arr_comma)
        fputc(',', o->f);
    o->arr_comma = true;
    fputs(v ? "true" : "false", o->f);
}

static const char *jget_str(cJSON *o, const char *k, const char *def) {
    cJSON *v = cJSON_GetObjectItemCaseSensitive(o, k);
    if (v && cJSON_IsString(v))
        return v->valuestring;
    return def;
}
static double jget_num(cJSON *o, const char *k, double def) {
    cJSON *v = cJSON_GetObjectItemCaseSensitive(o, k);
    if (v && cJSON_IsNumber(v))
        return v->valuedouble;
    return def;
}
static bool jget_bool(cJSON *o, const char *k, bool def) {
    cJSON *v = cJSON_GetObjectItemCaseSensitive(o, k);
    if (v && cJSON_IsBool(v))
        return cJSON_IsTrue(v);
    return def;
}

// ---- serialize ------------------------------------------------------------
static void config_write_json(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_num(d, "cpuFreq", c->cpuFreq);
    jadd_str(d, "myCallsign", c->my_callsign);
    jadd_num(d, "myLAT", c->my_lat);
    jadd_num(d, "myLON", c->my_lon);
    jadd_num(d, "myALT", c->my_alt);
    jadd_num(d, "myPHGPower", c->my_phg_power);
    jadd_num(d, "myPHGGain", c->my_phg_gain);
    jadd_num(d, "myPHGHeight", c->my_phg_height);
    jadd_num(d, "myPHGDir", c->my_phg_dir);
    jadd_num(d, "myAmbiguity", c->pos_ambiguity);
    jadd_bool(d, "myStatusGrid", c->status_grid_en);
    jadd_bool(d, "myStatusTS", c->status_timestamp_en);
    jadd_num(d, "myStatusBeam", c->status_beam_deg);
    jadd_num(d, "myStatusERP", c->status_erp_watts);
    jadd_bool(d, "myNoArchive", c->my_no_archive);
    jadd_bool(d, "myPosDao", c->pos_dao_en);
    jadd_num(d, "txTimeSlot", c->tx_timeslot);
    jadd_num(d, "csmaPersist", c->csma_persist);
    jadd_bool(d, "syncTime", c->synctime);
    jadd_str(d, "ntpHost0", c->ntp_host[0]);
    jadd_str(d, "ntpHost1", c->ntp_host[1]);
    jadd_str(d, "ntpHost2", c->ntp_host[2]);
    jadd_num(d, "ntpResync", c->ntp_resync_sec);
    jadd_num(d, "timeZone", c->timezone_idx);
    jadd_num(d, "WiFiMode", c->wifi_mode);
    jadd_num(d, "WiFiPwr", c->wifi_power);
    jadd_num(d, "WiFiAPCH", c->wifi_ap_ch);
    jadd_str(d, "WiFiAP_SSID", c->wifi_ap_ssid);
    jadd_str(d, "WiFiAP_PASS", c->wifi_ap_pass);
    jarr_begin(d, "WiFiSTA");
    for (int i = 0; i < WIFI_STA_NUM; i++) {
        jarr_bool(d, c->wifi_sta[i].enable);
        jarr_str(d, c->wifi_sta[i].wifi_ssid);
        jarr_str(d, c->wifi_sta[i].wifi_pass);
    }
    jarr_end(d);

    jadd_num(d, "fx25Mode", c->fx25_mode);
    jadd_num(d, "afskModem", c->afsk_modem_type);
    jadd_num(d, "rfPreamble", c->preamble);
    jadd_bool(d, "audioModemEn", c->audio_modem_en);
    jadd_bool(d, "audioLPF", c->audio_lpf);
    jadd_num(d, "rfTxBuffers", c->rf_tx_buffers);
    jadd_bool(d, "dutyCycleEn", c->duty_cycle_en);
    jadd_num(d, "dutyCyclePct", c->duty_cycle_pct);
    jadd_num(d, "pttMinUnkeyMs", c->ptt_min_unkey_ms);

    jadd_bool(d, "igateEn", c->igate_en);
    jadd_bool(d, "igateBcn", c->igate_bcn);
    jadd_bool(d, "rf2inet", c->rf2inet);
    jadd_bool(d, "inet2rf", c->inet2rf);
    jadd_bool(d, "igatePos2rf", c->igate_loc2rf);
    jadd_bool(d, "igatePos2inet", c->igate_loc2inet);
    jadd_num(d, "rf2inetFilter", c->rf2inetFilter);
    jadd_num(d, "inet2rfFilter", c->inet2rfFilter);
    jadd_num(d, "rf2inetBudlistMode", c->rf2inet_budlist_mode);
    jadd_num(d, "inet2rfBudlistMode", c->inet2rf_budlist_mode);
    jarr_begin(d, "budlist");
    for (int i = 0; i < IGATE_BUDLIST_MAX; i++)
        jarr_str(d, c->budlist[i]);
    jarr_end(d);
    jarr_begin(d, "satgate");
    for (int i = 0; i < IGATE_SATGATE_MAX; i++)
        jarr_str(d, c->satgate[i]);
    jarr_end(d);
    jadd_num(d, "dupCacheSize", c->dup_cache_size);
    jadd_num(d, "dupCacheTimeoutMs", c->dup_cache_timeout_ms);
    jadd_bool(d, "rf2inetRangeEn", c->rf2inet_range_en);
    jadd_num(d, "rf2inetRangeKm", c->rf2inet_range_km);
    jadd_bool(d, "rf2inetPrefixEn", c->rf2inet_prefix_en);
    jadd_str(d, "rf2inetPrefixes", c->rf2inet_prefixes);
    jadd_bool(d, "inet2rf3rdPartyUnwrapEn", c->inet2rf_3rdparty_unwrap_en);
    jadd_bool(d, "igateMsgGateEn", c->igate_msg_gate_en);
    jadd_num(d, "igateLocalWindowSec", c->igate_local_window_sec);
    jadd_num(d, "igateMsgMaxHops", c->igate_msg_max_hops);
    jadd_num(d, "igateSSID", c->aprs_ssid);
    jarr_begin(d, "igateServers");
    for (int i = 0; i < APRS_SERVER_NUM; i++) {
        jarr_bool(d, c->aprs_server[i].enable);
        jarr_str(d, c->aprs_server[i].host);
        jarr_num(d, c->aprs_server[i].port);
    }
    jarr_end(d);
    jadd_str(d, "igateMycall", c->aprs_mycall);
    jadd_bool(d, "igateUseStation", c->igate_use_station);
    jadd_str(d, "igatePasscode", c->aprs_passcode);
    jadd_str(d, "igateFilter", c->aprs_filter);
    jadd_num(d, "igateLAT", c->igate_lat);
    jadd_num(d, "igateLON", c->igate_lon);
    jadd_num(d, "igateALT", c->igate_alt);
    jadd_num(d, "igateINV", c->igate_interval);
    jadd_str(d, "igateSymbol", c->igate_symbol);
    jadd_num(d, "igatePath", c->igate_path);
    jadd_str(d, "igateComment", c->igate_comment);
    jadd_num(d, "igateSTSIntv", c->igate_sts_interval);
    jadd_str(d, "igateStatus", c->igate_status);
    jadd_bool(d, "igateTimestamp", c->igate_timestamp);
    jadd_bool(d, "igateCompress", c->igate_compress);
    jadd_bool(d, "igatePHGEn", c->igate_phg_enable);
    jadd_bool(d, "igatePHGUseStation", c->igate_phg_use_station);
    jadd_num(d, "igatePHGPower", c->igate_phg_power);
    jadd_num(d, "igatePHGGain", c->igate_phg_gain);
    jadd_num(d, "igatePHGHeight", c->igate_phg_height);
    jadd_num(d, "igatePHGDir", c->igate_phg_dir);
    jadd_num(d, "igateExtType", c->igate_ext_type);
    jadd_num(d, "igateRng", c->igate_range_miles);
    jadd_num(d, "igateDfsS", c->igate_dfs_strength);
    jadd_num(d, "igateDfBrg", c->igate_df_bearing);
    jadd_num(d, "igateDfN", c->igate_df_nrq_n);
    jadd_num(d, "igateDfR", c->igate_df_nrq_r);
    jadd_num(d, "igateDfQ", c->igate_df_nrq_q);
    jadd_num(d, "igateFreqMHz", c->igate_freq_mhz);
    jadd_num(d, "igateFreqTone", c->igate_tone_tenths);
    jadd_num(d, "igateFreqDup", c->igate_duplex);
    jadd_num(d, "igateFreqOff", c->igate_offset_khz);

    jadd_bool(d, "digiEn", c->digi_en);
    jadd_bool(d, "digiPos2rf", c->digi_loc2rf);
    jadd_bool(d, "digiPos2inet", c->digi_loc2inet);
    jadd_bool(d, "digiTime", c->digi_timestamp);
    jadd_num(d, "digiSSID", c->digi_ssid);
    jadd_str(d, "digiMycall", c->digi_mycall);
    jadd_bool(d, "digiUseStation", c->digi_use_station);
    jadd_num(d, "digiPath", c->digi_path);
    jarr_begin(d, "digiAlias");
    for (int i = 0; i < DIGI_ALIAS_MAX; i++)
        jarr_str(d, c->digi_alias[i].alias);
    jarr_end(d);
    jarr_begin(d, "digiAliasMaxN");
    for (int i = 0; i < DIGI_ALIAS_MAX; i++)
        jarr_num(d, c->digi_alias[i].max_n);
    jarr_end(d);
    jarr_begin(d, "digiAliasMode");
    for (int i = 0; i < DIGI_ALIAS_MAX; i++)
        jarr_num(d, c->digi_alias[i].mode);
    jarr_end(d);
    jadd_bool(d, "digiFillinOnly", c->digi_fillin_only);
    jadd_bool(d, "digiTrapNClamp", c->digi_trap_n_clamp);
    jadd_bool(d, "digiDestSsidEn", c->digi_dest_ssid_en);
    jadd_num(d, "digiPreempt", c->digi_preempt);
    jadd_bool(d, "digiBcn", c->digi_bcn);
    jadd_bool(d, "digiCompress", c->digi_compress);
    jadd_num(d, "digiAlt", c->digi_alt);
    jadd_num(d, "digiLAT", c->digi_lat);
    jadd_num(d, "digiLON", c->digi_lon);
    jadd_num(d, "digiINV", c->digi_interval);
    jadd_str(d, "digiSymbol", c->digi_symbol);
    jadd_str(d, "digiComment", c->digi_comment);
    jadd_num(d, "digiSTSIntv", c->digi_sts_interval);
    jadd_str(d, "digiStatus", c->digi_status);
    jadd_bool(d, "digiPHGEn", c->digi_phg_enable);
    jadd_bool(d, "digiPHGUseStation", c->digi_phg_use_station);
    jadd_num(d, "digiPHGPower", c->digi_phg_power);
    jadd_num(d, "digiPHGGain", c->digi_phg_gain);
    jadd_num(d, "digiPHGHeight", c->digi_phg_height);
    jadd_num(d, "digiPHGDir", c->digi_phg_dir);
    jadd_num(d, "digiExtType", c->digi_ext_type);
    jadd_num(d, "digiRng", c->digi_range_miles);
    jadd_num(d, "digiDfsS", c->digi_dfs_strength);
    jadd_num(d, "digiDfBrg", c->digi_df_bearing);
    jadd_num(d, "digiDfN", c->digi_df_nrq_n);
    jadd_num(d, "digiDfR", c->digi_df_nrq_r);
    jadd_num(d, "digiDfQ", c->digi_df_nrq_q);
    jadd_num(d, "digiFreqMHz", c->digi_freq_mhz);
    jadd_num(d, "digiFreqTone", c->digi_tone_tenths);
    jadd_num(d, "digiFreqDup", c->digi_duplex);
    jadd_num(d, "digiFreqOff", c->digi_offset_khz);

    jadd_bool(d, "trkEn", c->trk_en);
    jadd_bool(d, "trkPos2rf", c->trk_loc2rf);
    jadd_bool(d, "trkPos2inet", c->trk_loc2inet);
    jadd_bool(d, "trkTime", c->trk_timestamp);
    jadd_num(d, "trkSSID", c->trk_ssid);
    jadd_str(d, "trkMycall", c->trk_mycall);
    jadd_bool(d, "trkUseStation", c->trk_use_station);
    jadd_num(d, "trkPath", c->trk_path);
    jadd_num(d, "trkLAT", c->trk_lat);
    jadd_num(d, "trkLON", c->trk_lon);
    jadd_num(d, "trkALT", c->trk_alt);
    jadd_num(d, "trkINV", c->trk_interval);
    jadd_bool(d, "trkCompress", c->trk_compress);
    jadd_bool(d, "trkPHG", c->trk_phg_enable);
    jadd_bool(d, "trkMice", c->trk_mice);
    jadd_num(d, "trkMiceMsg", c->trk_mice_msg);
    jadd_bool(d, "trkOptAlt", c->trk_altitude);
    jadd_str(d, "trkSymbol", c->trk_symbol);
    jadd_str(d, "trkComment", c->trk_comment);
    jadd_num(d, "trkSTSIntv", c->trk_sts_interval);
    jadd_str(d, "trkStatus", c->trk_status);
    jadd_num(d, "trkFreqMHz", c->trk_freq_mhz);
    jadd_num(d, "trkFreqTone", c->trk_tone_tenths);
    jadd_num(d, "trkFreqDup", c->trk_duplex);
    jadd_num(d, "trkFreqOff", c->trk_offset_khz);

    jadd_bool(d, "wxEn", c->wx_en);
    jadd_bool(d, "wxTx2rf", c->wx_2rf);
    jadd_bool(d, "wxTx2inet", c->wx_2inet);
    jadd_bool(d, "wxTime", c->wx_timestamp);
    jadd_num(d, "wxSSID", c->wx_ssid);
    jadd_str(d, "wxMycall", c->wx_mycall);
    jadd_bool(d, "wxUseStation", c->wx_use_station);
    jadd_num(d, "wxPath", c->wx_path);
    jadd_num(d, "wxLAT", c->wx_lat);
    jadd_num(d, "wxLON", c->wx_lon);
    jadd_num(d, "wxInv", c->wx_interval);
    jadd_str(d, "wxObject", c->wx_object);
    jadd_str(d, "wxComment", c->wx_comment);
    jarr_begin(d, "wxSenEn");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_bool(d, c->wx_sensor_enable[i]);
    jarr_end(d);
    jarr_begin(d, "wxSenAvg");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_bool(d, c->wx_sensor_avg[i]);
    jarr_end(d);
    // Sensor mappings travel as driver NAMES, not registry positions: a
    // position only means anything within the firmware image that produced it
    // (see the persistence contract in sensors_local.h), so storing the index
    // would re-point all 13 WX fields at different sensors the moment a driver
    // is enabled or disabled in Kconfig. An unmapped field writes "".
    jarr_begin(d, "wxSenCH");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_str(d, sensors_local_channel_name(c->wx_sensor_ch[i]));
    jarr_end(d);

