hiperiondev/esp32idf_APRS/main/app_config.c
    // Telemetry configuration (channel 0/1, Binary B1-B8 mapping) is no
    // longer part of config.json - see telemetry.h/.c and /storage/telemetry.json.

    jadd_str(d, "httpUser", c->http_username);
    jadd_str(d, "httpPass", c->http_password);
    jarr_begin(d, "path");
    for (int i = 0; i < 4; i++)
        jarr_str(d, c->path[i]);
    jarr_end(d);

    // rfPTT (PTT GPIO) and rfPTTAct (PTT active-high) are not serialized:
    // both are fixed compile-time constants (MODEM_PTT_GPIO /
    // MODEM_PTT_ACTIVE_HIGH), not stored settings.

    jadd_bool(d, "msgEnable", c->msg_enable);
    jadd_str(d, "msgMycall", c->msg_mycall);
    jadd_bool(d, "msgUseStation", c->msg_use_station);
    jadd_bool(d, "msgRf", c->msg_rf);
    jadd_bool(d, "msgInet", c->msg_inet);
    jadd_num(d, "msgPath", c->msg_path);
    jadd_num(d, "msgRetry", c->msg_retry);
    jadd_num(d, "msgInterval", c->msg_interval);
    jadd_bool(d, "msgAlarmEn", c->msg_alarm_enable);
    jadd_num(d, "msgAlarmGpio", c->msg_alarm_gpio);
    jarr_begin(d, "msgGroup");
    for (int i = 0; i < 3; i++)
        jarr_str(d, c->msg_group[i]);
    jarr_end(d);

    jadd_bool(d, "queryEn", c->query_en);
    jadd_bool(d, "queryRf", c->query_rf);
    jadd_bool(d, "queryInet", c->query_inet);
    jadd_bool(d, "queryAprsEn", c->query_aprs_en);
    jadd_bool(d, "queryWxEn", c->query_wx_en);
    jadd_bool(d, "queryIgateEn", c->query_igate_en);
    jadd_bool(d, "queryDirectedEn", c->query_directed_en);
    jadd_bool(d, "queryExtEn", c->query_ext_en);
    jadd_num(d, "queryMinInterval", c->query_min_interval_sec);
    jadd_bool(d, "queryCapEn", c->query_cap_beacon_en);
    jadd_num(d, "queryCapIntv", c->query_cap_interval_sec);
    jadd_bool(d, "queryCapRf", c->query_cap_rf);
    jadd_bool(d, "queryCapInet", c->query_cap_inet);
    jadd_str(d, "queryCapExtra", c->query_cap_extra);

    fputc('}', d->f);
}

// ---- deserialize ------------------------------------------------------------

// Bounds a stored "<table><code>" symbol pair to what chapter 21 defines,
// the same two sets the symbol form enforces. Neither byte is cosmetic: the
// table identifier decides how a receiver reads the rest of a compressed
// position report, and the code decides which classifier the report lands in,
// so a byte that arrived from a hand-edited config.json is folded back to the
// default rather than beaconed.
void app_config_query_cap_extra_sanitize(char *extra) {
    if (extra == NULL)
        return;

    size_t w = 0;
    for (size_t r = 0; extra[r] != 0; r++) {
        char c = extra[r];
        if (c == '\r' || c == '\n' || c == ',' || c == '>')
            continue;
        extra[w++] = c;
    }
    extra[w] = 0;
}

static void clamp_symbol(char *sym, const char *key) {
    if (!aprs_symbol_table_is_valid(sym[0])) {
        ESP_LOGW(TAG, "%s table identifier 0x%02X is not valid, using '%c'", key, (unsigned)(unsigned char)sym[0], APRS_SYMBOL_TABLE_DEFAULT);
        sym[0] = APRS_SYMBOL_TABLE_DEFAULT;
    }
    if (!aprs_symbol_code_is_valid(sym[1])) {
        ESP_LOGW(TAG, "%s code 0x%02X is not valid, using '%c'", key, (unsigned)(unsigned char)sym[1], APRS_SYMBOL_CODE_DEFAULT);
        sym[1] = APRS_SYMBOL_CODE_DEFAULT;
    }
    sym[2] = 0;
}

// Bounds one stored DF report NRQ digit. N, R and Q are a single decimal
// digit each on air, so a wider stored value would push the following bytes
// of the extension out of position for every receiver.
static uint8_t clamp_nrq_digit(double value, const char *key) {
    int v = (int)value;
    if (v < APRS_EXT_DF_NRQ_MIN || v > APRS_EXT_DF_NRQ_MAX) {
        int clamped = (v < APRS_EXT_DF_NRQ_MIN) ? APRS_EXT_DF_NRQ_MIN : APRS_EXT_DF_NRQ_MAX;
        ESP_LOGW(TAG, "%s %d out of range, clamped to %d", key, v, clamped);
        v = clamped;
    }
    return (uint8_t)v;
}

static void config_from_json(cJSON *d, app_config_t *c) {
    // Start from defaults so every key not present in an older config file
    // still ends up with a sane, documented value (never zero-garbage).
    app_config_t def;
    app_config_set_defaults(&def);
    *c = def;

    c->cpuFreq = (uint8_t)jget_num(d, "cpuFreq", def.cpuFreq);
    set_str(c->my_callsign, sizeof(c->my_callsign), jget_str(d, "myCallsign", def.my_callsign));
    c->my_lat = (float)jget_num(d, "myLAT", def.my_lat);
    c->my_lon = (float)jget_num(d, "myLON", def.my_lon);
    c->my_alt = (float)jget_num(d, "myALT", def.my_alt);
    c->my_phg_power = (uint16_t)jget_num(d, "myPHGPower", def.my_phg_power);
    c->my_phg_gain = (float)jget_num(d, "myPHGGain", def.my_phg_gain);
    c->my_phg_height = (uint16_t)jget_num(d, "myPHGHeight", def.my_phg_height);
    c->my_phg_dir = (uint8_t)jget_num(d, "myPHGDir", def.my_phg_dir);
    c->pos_ambiguity = (uint8_t)jget_num(d, "myAmbiguity", def.pos_ambiguity);
    if (c->pos_ambiguity > POS_AMBIGUITY_MAX) {
        ESP_LOGW(TAG, "myAmbiguity %u out of range, clamped to %d", (unsigned)c->pos_ambiguity, POS_AMBIGUITY_MAX);
        c->pos_ambiguity = POS_AMBIGUITY_MAX;
    }
    c->status_grid_en = jget_bool(d, "myStatusGrid", def.status_grid_en);
    c->status_timestamp_en = jget_bool(d, "myStatusTS", def.status_timestamp_en);
    {
        // Same two-layer clamp the web form applies, so a hand-edited or
        // imported config.json cannot put a heading or a power on air that the
        // two code characters have no room for. A heading is quantised to the
        // step the field encodes in; anything outside the range switches the
        // block off rather than being folded into an unrelated bearing.
        int beam = (int)jget_num(d, "myStatusBeam", def.status_beam_deg);
        if (beam < 0 || beam > STATUS_BEAM_DEG_MAX) {
            if (beam != STATUS_BEAM_DEG_OFF)
                ESP_LOGW(TAG, "status beam heading %d out of range - beam/ERP block disabled", beam);
            beam = STATUS_BEAM_DEG_OFF;
        } else {
            beam -= beam % STATUS_BEAM_DEG_STEP;
        }
        c->status_beam_deg = (int16_t)beam;

        long erp = (long)jget_num(d, "myStatusERP", def.status_erp_watts);
        if (erp < 0)
            erp = 0;
        if (erp > STATUS_ERP_WATTS_MAX) {
            ESP_LOGW(TAG, "status ERP %ld W above the %d W table maximum - clamped", erp, STATUS_ERP_WATTS_MAX);
            erp = STATUS_ERP_WATTS_MAX;
        }
        c->status_erp_watts = (uint16_t)erp;
    }
    c->my_no_archive = jget_bool(d, "myNoArchive", def.my_no_archive);
    c->pos_dao_en = jget_bool(d, "myPosDao", def.pos_dao_en);
    // Channel-access timing: bound every value coming off flash to the same
    // range the Radiomodem form accepts (aprs_service.h), so a hand-edited or
    // imported config.json cannot hand aprs_service_build_modem_config() a
    // setting the radio should never transmit with - see the note there on
    // what an unbounded preamble does to a shared channel.
    c->tx_timeslot = (uint16_t)jget_num(d, "txTimeSlot", def.tx_timeslot);
    if (c->tx_timeslot > RF_TX_TIMESLOT_MS_MAX) {
        ESP_LOGW(TAG, "txTimeSlot %u out of range, clamped to %d ms", (unsigned)c->tx_timeslot, RF_TX_TIMESLOT_MS_MAX);
        c->tx_timeslot = RF_TX_TIMESLOT_MS_MAX;
    }
    c->csma_persist = (uint8_t)jget_num(d, "csmaPersist", def.csma_persist);
    if (c->csma_persist < CSMA_PERSIST_MIN)
        c->csma_persist = CSMA_PERSIST_MIN;
    c->synctime = jget_bool(d, "syncTime", def.synctime);
    set_str(c->ntp_host[0], sizeof(c->ntp_host[0]), jget_str(d, "ntpHost0", jget_str(d, "ntpHost", def.ntp_host[0])));
    set_str(c->ntp_host[1], sizeof(c->ntp_host[1]), jget_str(d, "ntpHost1", def.ntp_host[1]));
    set_str(c->ntp_host[2], sizeof(c->ntp_host[2]), jget_str(d, "ntpHost2", def.ntp_host[2]));
    c->ntp_resync_sec = (uint16_t)jget_num(d, "ntpResync", def.ntp_resync_sec);
    if (c->ntp_resync_sec < NTP_RESYNC_MIN_SEC)
        c->ntp_resync_sec = NTP_RESYNC_MIN_SEC;
    c->timezone_idx = (uint8_t)jget_num(d, "timeZone", def.timezone_idx);
    if (c->timezone_idx >= time_sync_tz_count()) {
        ESP_LOGW(TAG, "timeZone %u out of range, clamped to 0 (UTC)", (unsigned)c->timezone_idx);
        c->timezone_idx = 0;
    }
    c->wifi_mode = (uint8_t)jget_num(d, "WiFiMode", def.wifi_mode);
    // Read through an int so a value the file carries far outside int8_t range
    // is bounded here rather than wrapping into a small negative on the cast:
    // main.c multiplies this by four for the driver's quarter-dBm argument, so
    // anything outside the accepted band either overflows that multiply or is
    // refused by esp_wifi_set_max_tx_power(), silently leaving whatever power
    // the radio came up with.
    int wifiPwr = (int)jget_num(d, "WiFiPwr", def.wifi_power);
    if (wifiPwr < WIFI_TX_POWER_DBM_MIN || wifiPwr > WIFI_TX_POWER_DBM_MAX) {
        ESP_LOGW(TAG, "stored WiFi TX power %d outside %d-%d dBm, clamped", wifiPwr, WIFI_TX_POWER_DBM_MIN, WIFI_TX_POWER_DBM_MAX);
        wifiPwr = (wifiPwr < WIFI_TX_POWER_DBM_MIN) ? WIFI_TX_POWER_DBM_MIN : WIFI_TX_POWER_DBM_MAX;
    }
    c->wifi_power = (int8_t)wifiPwr;
    c->wifi_ap_ch = (uint8_t)jget_num(d, "WiFiAPCH", def.wifi_ap_ch);
    // The file on flash is not a trusted input: it can arrive from a crafted
    // POST, a hand edit over the Storage page, or a backup taken from a build
    // with a different regulatory range. A channel outside WIFI_AP_CH_MIN..MAX
    // is rejected by esp_wifi_set_config(), which would take the access point
    // - the only way back into the device - down with it, so it is folded back
    // to the default here rather than carried into wifi_init().
    if (c->wifi_ap_ch < WIFI_AP_CH_MIN || c->wifi_ap_ch > WIFI_AP_CH_MAX) {
        ESP_LOGW(TAG, "stored SoftAP channel %u outside %u-%u, using %u", (unsigned)c->wifi_ap_ch, (unsigned)WIFI_AP_CH_MIN, (unsigned)WIFI_AP_CH_MAX,
                 (unsigned)WIFI_AP_CH_DEFAULT);
        c->wifi_ap_ch = WIFI_AP_CH_DEFAULT;
    }
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), jget_str(d, "WiFiAP_SSID", def.wifi_ap_ssid));
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), jget_str(d, "WiFiAP_PASS", def.wifi_ap_pass));
    {
        cJSON *arr = cJSON_GetObjectItemCaseSensitive(d, "WiFiSTA");
        if (arr && cJSON_IsArray(arr)) {
            for (int i = 0; i < WIFI_STA_NUM; i++) {
                cJSON *e = cJSON_GetArrayItem(arr, i * 3);
                cJSON *s = cJSON_GetArrayItem(arr, i * 3 + 1);
                cJSON *p = cJSON_GetArrayItem(arr, i * 3 + 2);
                c->wifi_sta[i].enable = e ? cJSON_IsTrue(e) : false;
                set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), (s && cJSON_IsString(s)) ? s->valuestring : def.wifi_sta[i].wifi_ssid);
                set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), (p && cJSON_IsString(p)) ? p->valuestring : def.wifi_sta[i].wifi_pass);
            }
        }
    }

    c->fx25_mode = (uint8_t)jget_num(d, "fx25Mode", def.fx25_mode);
    c->afsk_modem_type = (uint8_t)jget_num(d, "afskModem", def.afsk_modem_type);
    c->preamble = (uint16_t)jget_num(d, "rfPreamble", def.preamble);
    if (c->preamble < RF_PREAMBLE_MS_MIN || c->preamble > RF_PREAMBLE_MS_MAX) {
        ESP_LOGW(TAG, "rfPreamble %u out of range, clamped to %d..%d ms", (unsigned)c->preamble, RF_PREAMBLE_MS_MIN, RF_PREAMBLE_MS_MAX);
        c->preamble = (c->preamble < RF_PREAMBLE_MS_MIN) ? RF_PREAMBLE_MS_MIN : RF_PREAMBLE_MS_MAX;
    }
    c->audio_modem_en = jget_bool(d, "audioModemEn", def.audio_modem_en);
    c->audio_lpf = jget_bool(d, "audioLPF", def.audio_lpf);
    c->rf_tx_buffers = (uint8_t)jget_num(d, "rfTxBuffers", def.rf_tx_buffers);
    if (c->rf_tx_buffers < RF_TX_BUFFERS_MIN)
        c->rf_tx_buffers = RF_TX_BUFFERS_MIN;
    else if (c->rf_tx_buffers > RF_TX_BUFFERS_MAX)
        c->rf_tx_buffers = RF_TX_BUFFERS_MAX;
    c->duty_cycle_en = jget_bool(d, "dutyCycleEn", def.duty_cycle_en);
    c->duty_cycle_pct = (uint8_t)jget_num(d, "dutyCyclePct", def.duty_cycle_pct);
    if (c->duty_cycle_pct < DUTY_CYCLE_PCT_MIN)
        c->duty_cycle_pct = DUTY_CYCLE_PCT_MIN;
    else if (c->duty_cycle_pct > DUTY_CYCLE_PCT_MAX)
        c->duty_cycle_pct = DUTY_CYCLE_PCT_MAX;
    c->ptt_min_unkey_ms = (uint16_t)jget_num(d, "pttMinUnkeyMs", def.ptt_min_unkey_ms);
    if (c->ptt_min_unkey_ms > PTT_MIN_UNKEY_MS_MAX)
        c->ptt_min_unkey_ms = PTT_MIN_UNKEY_MS_MAX;

    c->igate_en = jget_bool(d, "igateEn", def.igate_en);
    c->igate_bcn = jget_bool(d, "igateBcn", def.igate_bcn);
    c->rf2inet = jget_bool(d, "rf2inet", def.rf2inet);
    c->inet2rf = jget_bool(d, "inet2rf", def.inet2rf);
    c->igate_loc2rf = jget_bool(d, "igatePos2rf", def.igate_loc2rf);
    c->igate_loc2inet = jget_bool(d, "igatePos2inet", def.igate_loc2inet);
    c->rf2inetFilter = (uint16_t)jget_num(d, "rf2inetFilter", def.rf2inetFilter);
    // "inet2rfFiltger" was a legacy misspelling of the key used when saving;
    // fall back to it so configs written by older firmware still load correctly.
    c->inet2rfFilter = (uint16_t)jget_num(d, "inet2rfFilter", (double)jget_num(d, "inet2rfFiltger", def.inet2rfFilter));
    c->rf2inet_budlist_mode = (budlist_mode_t)jget_num(d, "rf2inetBudlistMode", def.rf2inet_budlist_mode);
    c->inet2rf_budlist_mode = (budlist_mode_t)jget_num(d, "inet2rfBudlistMode", def.inet2rf_budlist_mode);
    {
        cJSON *bl = cJSON_GetObjectItemCaseSensitive(d, "budlist");
        for (int i = 0; i < IGATE_BUDLIST_MAX; i++) {
            cJSON *v = bl ? cJSON_GetArrayItem(bl, i) : NULL;
            set_str(c->budlist[i], sizeof(c->budlist[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.budlist[i]);
        }
    }
    {
        cJSON *sg = cJSON_GetObjectItemCaseSensitive(d, "satgate");
        for (int i = 0; i < IGATE_SATGATE_MAX; i++) {
            cJSON *v = sg ? cJSON_GetArrayItem(sg, i) : NULL;
            set_str(c->satgate[i], sizeof(c->satgate[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.satgate[i]);
        }
    }
    c->dup_cache_size = (uint8_t)jget_num(d, "dupCacheSize", def.dup_cache_size);
    if (c->dup_cache_size < DUP_CACHE_SIZE_MIN || c->dup_cache_size > DUP_CACHE_SIZE_MAX) {
        ESP_LOGW(TAG, "dupCacheSize %u out of range, clamped to %d..%d", (unsigned)c->dup_cache_size, DUP_CACHE_SIZE_MIN, DUP_CACHE_SIZE_MAX);
        c->dup_cache_size = (c->dup_cache_size < DUP_CACHE_SIZE_MIN) ? DUP_CACHE_SIZE_MIN : DUP_CACHE_SIZE_MAX;
    }
    c->dup_cache_timeout_ms = (uint32_t)jget_num(d, "dupCacheTimeoutMs", def.dup_cache_timeout_ms);
    if (c->dup_cache_timeout_ms < DUP_CACHE_TIMEOUT_MS_MIN || c->dup_cache_timeout_ms > DUP_CACHE_TIMEOUT_MS_MAX) {
        ESP_LOGW(TAG, "dupCacheTimeoutMs %u out of range, clamped to %d..%d ms", (unsigned)c->dup_cache_timeout_ms, DUP_CACHE_TIMEOUT_MS_MIN,
                 DUP_CACHE_TIMEOUT_MS_MAX);
        c->dup_cache_timeout_ms = (c->dup_cache_timeout_ms < DUP_CACHE_TIMEOUT_MS_MIN) ? DUP_CACHE_TIMEOUT_MS_MIN : DUP_CACHE_TIMEOUT_MS_MAX;
    }
    c->rf2inet_range_en = jget_bool(d, "rf2inetRangeEn", def.rf2inet_range_en);
    c->rf2inet_range_km = (float)jget_num(d, "rf2inetRangeKm", def.rf2inet_range_km);
    c->rf2inet_prefix_en = jget_bool(d, "rf2inetPrefixEn", def.rf2inet_prefix_en);
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), jget_str(d, "rf2inetPrefixes", def.rf2inet_prefixes));
    c->inet2rf_3rdparty_unwrap_en = jget_bool(d, "inet2rf3rdPartyUnwrapEn", def.inet2rf_3rdparty_unwrap_en);
    c->igate_msg_gate_en = jget_bool(d, "igateMsgGateEn", def.igate_msg_gate_en);
    // Same two-layer clamp the rest of the bounded fields use: the file on
    // flash is not a trusted input, and a window of zero would stop the
    // gateway putting any message on the air while a window of days would
    // keep transmitting to stations that left the area hours ago.
    c->igate_local_window_sec = (uint16_t)jget_num(d, "igateLocalWindowSec", def.igate_local_window_sec);
    if (c->igate_local_window_sec < IGATE_LOCAL_WINDOW_SEC_MIN || c->igate_local_window_sec > IGATE_LOCAL_WINDOW_SEC_MAX) {
        ESP_LOGW(TAG, "igateLocalWindowSec %u out of range, clamped to %d..%d s", (unsigned)c->igate_local_window_sec, IGATE_LOCAL_WINDOW_SEC_MIN,
                 IGATE_LOCAL_WINDOW_SEC_MAX);
        c->igate_local_window_sec = (c->igate_local_window_sec < IGATE_LOCAL_WINDOW_SEC_MIN) ? IGATE_LOCAL_WINDOW_SEC_MIN : IGATE_LOCAL_WINDOW_SEC_MAX;
    }
    // The hop limit takes the same treatment, read through an int so a stored
    // value outside the field's own range is caught before the narrowing cast
    // rather than after it: a limit longer than an AX.25 path can carry would
    // gate to stations no transmission from here can reach.
    {
        int maxHops = (int)jget_num(d, "igateMsgMaxHops", def.igate_msg_max_hops);
        if (maxHops < IGATE_MSG_MAX_HOPS_MIN || maxHops > IGATE_MSG_MAX_HOPS_MAX) {
            ESP_LOGW(TAG, "igateMsgMaxHops %d out of range, clamped to %d..%d hops", maxHops, IGATE_MSG_MAX_HOPS_MIN, IGATE_MSG_MAX_HOPS_MAX);
            maxHops = (maxHops < IGATE_MSG_MAX_HOPS_MIN) ? IGATE_MSG_MAX_HOPS_MIN : IGATE_MSG_MAX_HOPS_MAX;
        }
        c->igate_msg_max_hops = (uint8_t)maxHops;
    }
    c->aprs_ssid = (uint8_t)jget_num(d, "igateSSID", def.aprs_ssid);
    {
        cJSON *arr = cJSON_GetObjectItemCaseSensitive(d, "igateServers");
        if (arr && cJSON_IsArray(arr)) {
            for (int i = 0; i < APRS_SERVER_NUM; i++) {
                cJSON *e = cJSON_GetArrayItem(arr, i * 3);
                cJSON *h = cJSON_GetArrayItem(arr, i * 3 + 1);
                cJSON *p = cJSON_GetArrayItem(arr, i * 3 + 2);
                c->aprs_server[i].enable = e ? cJSON_IsTrue(e) : def.aprs_server[i].enable;
                set_str(c->aprs_server[i].host, sizeof(c->aprs_server[i].host), (h && cJSON_IsString(h)) ? h->valuestring : def.aprs_server[i].host);
                c->aprs_server[i].port = (uint16_t)((p && cJSON_IsNumber(p)) ? p->valuedouble : def.aprs_server[i].port);
                // Same two-layer clamp as the SoftAP channel above: the file
                // on flash is not a trusted input, and port 0 would send the
                // IGate into a reconnect loop against an address it can
                // never connect to. Only the low bound needs testing:
                // APRS_PORT_MAX is the full range of the uint16_t the value
                // is already narrowed to.
                if (c->aprs_server[i].port < APRS_PORT_MIN) {
                    ESP_LOGW(TAG, "stored APRS-IS server %d port %u outside %u-%u, using %u", i, (unsigned)c->aprs_server[i].port, (unsigned)APRS_PORT_MIN,
                             (unsigned)APRS_PORT_MAX, (unsigned)APRS_PORT_DEFAULT);
                    c->aprs_server[i].port = APRS_PORT_DEFAULT;
                }
            }
        } else {
            // Pre-failover config.json: migrate the single legacy "igateHost"
            // / "igatePort" pair into slot 0 so an upgraded device keeps
            // connecting to the same server it already had configured.
            for (int i = 0; i < APRS_SERVER_NUM; i++)
                c->aprs_server[i] = def.aprs_server[i];
            set_str(c->aprs_server[0].host, sizeof(c->aprs_server[0].host), jget_str(d, "igateHost", def.aprs_server[0].host));
            c->aprs_server[0].port = (uint16_t)jget_num(d, "igatePort", def.aprs_server[0].port);
            if (c->aprs_server[0].port < APRS_PORT_MIN) {
                ESP_LOGW(TAG, "stored APRS-IS port %u outside %u-%u, using %u", (unsigned)c->aprs_server[0].port, (unsigned)APRS_PORT_MIN,
                         (unsigned)APRS_PORT_MAX, (unsigned)APRS_PORT_DEFAULT);
                c->aprs_server[0].port = APRS_PORT_DEFAULT;
            }
            c->aprs_server[0].enable = true;
        }
    }
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), jget_str(d, "igateMycall", def.aprs_mycall));
    c->igate_use_station = jget_bool(d, "igateUseStation", def.igate_use_station);
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), jget_str(d, "igatePasscode", def.aprs_passcode));
    set_str(c->aprs_filter, sizeof(c->aprs_filter), jget_str(d, "igateFilter", def.aprs_filter));
    c->igate_lat = (float)jget_num(d, "igateLAT", def.igate_lat);
    c->igate_lon = (float)jget_num(d, "igateLON", def.igate_lon);
    c->igate_alt = (float)jget_num(d, "igateALT", def.igate_alt);
    c->igate_interval = (uint16_t)jget_num(d, "igateINV", def.igate_interval);
    set_str(c->igate_symbol, sizeof(c->igate_symbol), jget_str(d, "igateSymbol", def.igate_symbol));
    clamp_symbol(c->igate_symbol, "igateSymbol");
    c->igate_path = (uint8_t)jget_num(d, "igatePath", def.igate_path);
    set_str_utf8(c->igate_comment, sizeof(c->igate_comment), jget_str(d, "igateComment", def.igate_comment));
    c->igate_timestamp = jget_bool(d, "igateTimestamp", def.igate_timestamp);
    c->igate_compress = jget_bool(d, "igateCompress", def.igate_compress);
    c->igate_phg_enable = jget_bool(d, "igatePHGEn", def.igate_phg_enable);
    c->igate_phg_use_station = jget_bool(d, "igatePHGUseStation", def.igate_phg_use_station);
    c->igate_phg_power = (uint16_t)jget_num(d, "igatePHGPower", def.igate_phg_power);
    c->igate_phg_gain = (float)jget_num(d, "igatePHGGain", def.igate_phg_gain);
    c->igate_phg_height = (uint16_t)jget_num(d, "igatePHGHeight", def.igate_phg_height);
    c->igate_phg_dir = (uint8_t)jget_num(d, "igatePHGDir", def.igate_phg_dir);
    c->igate_ext_type = (uint8_t)jget_num(d, "igateExtType", def.igate_ext_type);
    if (c->igate_ext_type > APRS_EXT_DF) {
        ESP_LOGW(TAG, "igateExtType %u unknown, using PHG", (unsigned)c->igate_ext_type);
        c->igate_ext_type = APRS_EXT_PHG;
    }
    c->igate_range_miles = (uint16_t)jget_num(d, "igateRng", def.igate_range_miles);
    if (c->igate_range_miles > APRS_EXT_RANGE_MILES_MAX) {
        ESP_LOGW(TAG, "igateRng %u out of range, clamped to %d", (unsigned)c->igate_range_miles, APRS_EXT_RANGE_MILES_MAX);
        c->igate_range_miles = APRS_EXT_RANGE_MILES_MAX;
    }
    c->igate_dfs_strength = (uint8_t)jget_num(d, "igateDfsS", def.igate_dfs_strength);
    if (c->igate_dfs_strength > APRS_EXT_DFS_STRENGTH_MAX) {
        ESP_LOGW(TAG, "igateDfsS %u out of range, clamped to %d", (unsigned)c->igate_dfs_strength, APRS_EXT_DFS_STRENGTH_MAX);
        c->igate_dfs_strength = APRS_EXT_DFS_STRENGTH_MAX;
    }
    {
        // The bearing wraps rather than clamps: 360 degrees and 0 degrees name
        // the same direction, and the on-air field is three digits, so a value
        // outside the range still has one correct reading.
        int brg = (int)jget_num(d, "igateDfBrg", def.igate_df_bearing);
        int wrapped = brg % 360;
        if (wrapped < 0)
            wrapped += 360;
        if (wrapped != brg)
            ESP_LOGW(TAG, "igateDfBrg %d out of range, wrapped to %d", brg, wrapped);
        c->igate_df_bearing = (uint16_t)wrapped;
    }
    c->igate_df_nrq_n = clamp_nrq_digit(jget_num(d, "igateDfN", def.igate_df_nrq_n), "igateDfN");
    c->igate_df_nrq_r = clamp_nrq_digit(jget_num(d, "igateDfR", def.igate_df_nrq_r), "igateDfR");
    c->igate_df_nrq_q = clamp_nrq_digit(jget_num(d, "igateDfQ", def.igate_df_nrq_q), "igateDfQ");
    c->igate_freq_mhz = (float)jget_num(d, "igateFreqMHz", def.igate_freq_mhz);
    c->igate_tone_tenths = (uint16_t)jget_num(d, "igateFreqTone", def.igate_tone_tenths);
    c->igate_duplex = (int8_t)jget_num(d, "igateFreqDup", def.igate_duplex);
    c->igate_offset_khz = (uint16_t)jget_num(d, "igateFreqOff", def.igate_offset_khz);
    c->igate_sts_interval = (uint16_t)jget_num(d, "igateSTSIntv", def.igate_sts_interval);
    set_str_utf8(c->igate_status, sizeof(c->igate_status), jget_str(d, "igateStatus", def.igate_status));

