hiperiondev/esp32idf_APRS/main/app_config.c
    c->digi_en = jget_bool(d, "digiEn", def.digi_en);
    c->digi_loc2rf = jget_bool(d, "digiPos2rf", def.digi_loc2rf);
    c->digi_loc2inet = jget_bool(d, "digiPos2inet", def.digi_loc2inet);
    c->digi_timestamp = jget_bool(d, "digiTime", def.digi_timestamp);
    c->digi_ssid = (uint8_t)jget_num(d, "digiSSID", def.digi_ssid);
    set_str(c->digi_mycall, sizeof(c->digi_mycall), jget_str(d, "digiMycall", def.digi_mycall));
    c->digi_use_station = jget_bool(d, "digiUseStation", def.digi_use_station);
    c->digi_path = (uint8_t)jget_num(d, "digiPath", def.digi_path);
    // Alias table: three parallel arrays, one row per index, following the
    // same shape as the budlist/satgate lists above. A row is validated on the
    // way in rather than trusted: an out-of-range hop limit or an unknown mode
    // would otherwise decide how this station repeats other people's traffic.
    {
        cJSON *al = cJSON_GetObjectItemCaseSensitive(d, "digiAlias");
        cJSON *an = cJSON_GetObjectItemCaseSensitive(d, "digiAliasMaxN");
        cJSON *am = cJSON_GetObjectItemCaseSensitive(d, "digiAliasMode");
        for (int i = 0; i < DIGI_ALIAS_MAX; i++) {
            cJSON *v = al ? cJSON_GetArrayItem(al, i) : NULL;
            set_str(c->digi_alias[i].alias, sizeof(c->digi_alias[i].alias), (v && cJSON_IsString(v)) ? v->valuestring : def.digi_alias[i].alias);

            cJSON *n = an ? cJSON_GetArrayItem(an, i) : NULL;
            c->digi_alias[i].max_n = (uint8_t)((n && cJSON_IsNumber(n)) ? n->valuedouble : def.digi_alias[i].max_n);
            if (c->digi_alias[i].max_n < 1 || c->digi_alias[i].max_n > DIGI_ALIAS_MAX_N) {
                ESP_LOGW(TAG, "digiAliasMaxN[%d] %u out of range, clamped to 1..%d", i, (unsigned)c->digi_alias[i].max_n, DIGI_ALIAS_MAX_N);
                c->digi_alias[i].max_n = (c->digi_alias[i].max_n < 1) ? 1 : DIGI_ALIAS_MAX_N;
            }

            cJSON *m = am ? cJSON_GetArrayItem(am, i) : NULL;
            c->digi_alias[i].mode = (uint8_t)((m && cJSON_IsNumber(m)) ? m->valuedouble : def.digi_alias[i].mode);
            if (c->digi_alias[i].mode != DIGI_ALIAS_OFF && c->digi_alias[i].mode != DIGI_ALIAS_TRACE && c->digi_alias[i].mode != DIGI_ALIAS_FLOOD) {
                ESP_LOGW(TAG, "digiAliasMode[%d] %u unknown, row disabled", i, (unsigned)c->digi_alias[i].mode);
                c->digi_alias[i].mode = DIGI_ALIAS_OFF;
            }
        }
    }
    c->digi_fillin_only = jget_bool(d, "digiFillinOnly", def.digi_fillin_only);
    c->digi_trap_n_clamp = jget_bool(d, "digiTrapNClamp", def.digi_trap_n_clamp);
    c->digi_dest_ssid_en = jget_bool(d, "digiDestSsidEn", def.digi_dest_ssid_en);
    c->digi_preempt = (uint8_t)jget_num(d, "digiPreempt", def.digi_preempt);
    if (c->digi_preempt != DIGI_PREEMPT_OFF && c->digi_preempt != DIGI_PREEMPT_DROP && c->digi_preempt != DIGI_PREEMPT_MARK) {
        ESP_LOGW(TAG, "digiPreempt %u unknown, preemptive digipeating disabled", (unsigned)c->digi_preempt);
        c->digi_preempt = DIGI_PREEMPT_OFF;
    }
    c->digi_bcn = jget_bool(d, "digiBcn", def.digi_bcn);
    c->digi_compress = jget_bool(d, "digiCompress", def.digi_compress);
    c->digi_alt = (float)jget_num(d, "digiAlt", def.digi_alt);
    c->digi_lat = (float)jget_num(d, "digiLAT", def.digi_lat);
    c->digi_lon = (float)jget_num(d, "digiLON", def.digi_lon);
    c->digi_interval = (uint16_t)jget_num(d, "digiINV", def.digi_interval);
    set_str(c->digi_symbol, sizeof(c->digi_symbol), jget_str(d, "digiSymbol", def.digi_symbol));
    clamp_symbol(c->digi_symbol, "digiSymbol");
    set_str_utf8(c->digi_comment, sizeof(c->digi_comment), jget_str(d, "digiComment", def.digi_comment));
    c->digi_sts_interval = (uint16_t)jget_num(d, "digiSTSIntv", def.digi_sts_interval);
    set_str_utf8(c->digi_status, sizeof(c->digi_status), jget_str(d, "digiStatus", def.digi_status));
    c->digi_phg_enable = jget_bool(d, "digiPHGEn", def.digi_phg_enable);
    c->digi_phg_use_station = jget_bool(d, "digiPHGUseStation", def.digi_phg_use_station);
    c->digi_phg_power = (uint16_t)jget_num(d, "digiPHGPower", def.digi_phg_power);
    c->digi_phg_gain = (float)jget_num(d, "digiPHGGain", def.digi_phg_gain);
    c->digi_phg_height = (uint16_t)jget_num(d, "digiPHGHeight", def.digi_phg_height);
    c->digi_phg_dir = (uint8_t)jget_num(d, "digiPHGDir", def.digi_phg_dir);
    c->digi_ext_type = (uint8_t)jget_num(d, "digiExtType", def.digi_ext_type);
    if (c->digi_ext_type > APRS_EXT_DF) {
        ESP_LOGW(TAG, "digiExtType %u unknown, using PHG", (unsigned)c->digi_ext_type);
        c->digi_ext_type = APRS_EXT_PHG;
    }
    c->digi_range_miles = (uint16_t)jget_num(d, "digiRng", def.digi_range_miles);
    if (c->digi_range_miles > APRS_EXT_RANGE_MILES_MAX) {
        ESP_LOGW(TAG, "digiRng %u out of range, clamped to %d", (unsigned)c->digi_range_miles, APRS_EXT_RANGE_MILES_MAX);
        c->digi_range_miles = APRS_EXT_RANGE_MILES_MAX;
    }
    c->digi_dfs_strength = (uint8_t)jget_num(d, "digiDfsS", def.digi_dfs_strength);
    if (c->digi_dfs_strength > APRS_EXT_DFS_STRENGTH_MAX) {
        ESP_LOGW(TAG, "digiDfsS %u out of range, clamped to %d", (unsigned)c->digi_dfs_strength, APRS_EXT_DFS_STRENGTH_MAX);
        c->digi_dfs_strength = APRS_EXT_DFS_STRENGTH_MAX;
    }
    {
        // The bearing wraps rather than clamps: 360 degrees and 0 degrees name
        // the same direction, and the on-air field is three digits, so a value
        // outside the range still has one correct reading.
        int brg = (int)jget_num(d, "digiDfBrg", def.digi_df_bearing);
        int wrapped = brg % 360;
        if (wrapped < 0)
            wrapped += 360;
        if (wrapped != brg)
            ESP_LOGW(TAG, "digiDfBrg %d out of range, wrapped to %d", brg, wrapped);
        c->digi_df_bearing = (uint16_t)wrapped;
    }
    c->digi_df_nrq_n = clamp_nrq_digit(jget_num(d, "digiDfN", def.digi_df_nrq_n), "digiDfN");
    c->digi_df_nrq_r = clamp_nrq_digit(jget_num(d, "digiDfR", def.digi_df_nrq_r), "digiDfR");
    c->digi_df_nrq_q = clamp_nrq_digit(jget_num(d, "digiDfQ", def.digi_df_nrq_q), "digiDfQ");
    c->digi_freq_mhz = (float)jget_num(d, "digiFreqMHz", def.digi_freq_mhz);
    c->digi_tone_tenths = (uint16_t)jget_num(d, "digiFreqTone", def.digi_tone_tenths);
    c->digi_duplex = (int8_t)jget_num(d, "digiFreqDup", def.digi_duplex);
    c->digi_offset_khz = (uint16_t)jget_num(d, "digiFreqOff", def.digi_offset_khz);

