hiperiondev/esp32idf_APRS/main/app_config.c
    c->trk_en = jget_bool(d, "trkEn", def.trk_en);
    c->trk_loc2rf = jget_bool(d, "trkPos2rf", def.trk_loc2rf);
    c->trk_loc2inet = jget_bool(d, "trkPos2inet", def.trk_loc2inet);
    c->trk_timestamp = jget_bool(d, "trkTime", def.trk_timestamp);
    c->trk_ssid = (uint8_t)jget_num(d, "trkSSID", def.trk_ssid);
    set_str(c->trk_mycall, sizeof(c->trk_mycall), jget_str(d, "trkMycall", def.trk_mycall));
    c->trk_use_station = jget_bool(d, "trkUseStation", def.trk_use_station);
    c->trk_path = (uint8_t)jget_num(d, "trkPath", def.trk_path);
    c->trk_lat = (float)jget_num(d, "trkLAT", def.trk_lat);
    c->trk_lon = (float)jget_num(d, "trkLON", def.trk_lon);
    c->trk_alt = (float)jget_num(d, "trkALT", def.trk_alt);
    c->trk_interval = (uint16_t)jget_num(d, "trkINV", def.trk_interval);
    c->trk_compress = jget_bool(d, "trkCompress", def.trk_compress);
    c->trk_phg_enable = jget_bool(d, "trkPHG", def.trk_phg_enable);
    c->trk_mice = jget_bool(d, "trkMice", def.trk_mice);
    c->trk_mice_msg = (uint8_t)jget_num(d, "trkMiceMsg", def.trk_mice_msg);
    // Same two-layer clamp every other bounded field uses: the form handler
    // bounds what the operator can send, and this bounds what a hand-edited
    // or older config.json can carry into the beacon builder.
    if (c->trk_mice_msg > MICE_POS_COMMENT_MAX) {
        ESP_LOGW(TAG, "trkMiceMsg %u out of range (0-%d) - using %d", (unsigned)c->trk_mice_msg, MICE_POS_COMMENT_MAX, MICE_POS_COMMENT_DEFAULT);
        c->trk_mice_msg = MICE_POS_COMMENT_DEFAULT;
    }
    c->trk_altitude = jget_bool(d, "trkOptAlt", def.trk_altitude);
    set_str(c->trk_symbol, sizeof(c->trk_symbol), jget_str(d, "trkSymbol", def.trk_symbol));
    clamp_symbol(c->trk_symbol, "trkSymbol");
    set_str_utf8(c->trk_comment, sizeof(c->trk_comment), jget_str(d, "trkComment", def.trk_comment));
    c->trk_sts_interval = (uint16_t)jget_num(d, "trkSTSIntv", def.trk_sts_interval);
    set_str_utf8(c->trk_status, sizeof(c->trk_status), jget_str(d, "trkStatus", def.trk_status));
    c->trk_freq_mhz = (float)jget_num(d, "trkFreqMHz", def.trk_freq_mhz);
    c->trk_tone_tenths = (uint16_t)jget_num(d, "trkFreqTone", def.trk_tone_tenths);
    c->trk_duplex = (int8_t)jget_num(d, "trkFreqDup", def.trk_duplex);
    c->trk_offset_khz = (uint16_t)jget_num(d, "trkFreqOff", def.trk_offset_khz);

    c->wx_en = jget_bool(d, "wxEn", def.wx_en);
    c->wx_2rf = jget_bool(d, "wxTx2rf", def.wx_2rf);
    c->wx_2inet = jget_bool(d, "wxTx2inet", def.wx_2inet);
    c->wx_timestamp = jget_bool(d, "wxTime", def.wx_timestamp);
    c->wx_ssid = (uint8_t)jget_num(d, "wxSSID", def.wx_ssid);
    set_str(c->wx_mycall, sizeof(c->wx_mycall), jget_str(d, "wxMycall", def.wx_mycall));
    c->wx_use_station = jget_bool(d, "wxUseStation", def.wx_use_station);
    c->wx_path = (uint8_t)jget_num(d, "wxPath", def.wx_path);
    c->wx_lat = (float)jget_num(d, "wxLAT", def.wx_lat);
    c->wx_lon = (float)jget_num(d, "wxLON", def.wx_lon);
    c->wx_interval = (uint16_t)jget_num(d, "wxInv", def.wx_interval);
    set_str(c->wx_object, sizeof(c->wx_object), jget_str(d, "wxObject", def.wx_object));
    set_str_utf8(c->wx_comment, sizeof(c->wx_comment), jget_str(d, "wxComment", def.wx_comment));
    {
        cJSON *a1 = cJSON_GetObjectItemCaseSensitive(d, "wxSenEn"), *a2 = cJSON_GetObjectItemCaseSensitive(d, "wxSenAvg"),
              *a3 = cJSON_GetObjectItemCaseSensitive(d, "wxSenCH");
        for (int i = 0; i < WX_SENSOR_NUM; i++) {
            cJSON *v;
            if (a1 && (v = cJSON_GetArrayItem(a1, i)))
                c->wx_sensor_enable[i] = cJSON_IsTrue(v);
            if (a2 && (v = cJSON_GetArrayItem(a2, i)))
                c->wx_sensor_avg[i] = cJSON_IsTrue(v);
            if (a3 && (v = cJSON_GetArrayItem(a3, i))) {
                if (cJSON_IsString(v)) {
                    // Driver name (see the writer above): resolve it against
                    // the registry this image actually built. A name that is
                    // no longer registered leaves the field unmapped and says
                    // so, rather than aiming it at whatever sensor now sits at
                    // that position.
                    c->wx_sensor_ch[i] = sensors_local_channel_from_name(v->valuestring);
                    if (c->wx_sensor_ch[i] == SENSOR_LOCAL_CH_NONE && v->valuestring != NULL && v->valuestring[0] != 0)
                        ESP_LOGW(TAG, "WX field %d: sensor '%s' is not registered, left unmapped", i, v->valuestring);
                } else if (cJSON_IsNumber(v)) {
                    // A config.json that predates name-based mappings: the
                    // number is a registry position, and it is only meaningful
                    // if the registry still reaches that far.
                    unsigned idx = (unsigned)v->valuedouble;
                    if (idx != SENSOR_LOCAL_CH_NONE && idx >= sensors_local_count()) {
                        ESP_LOGW(TAG, "WX field %d: stored sensor channel %u no longer exists, left unmapped", i, idx);
                        idx = SENSOR_LOCAL_CH_NONE;
                    }
                    c->wx_sensor_ch[i] = (uint8_t)idx;
                }
            }
        }
    }

    // Telemetry configuration (channel 0/1, Binary B1-B8 mapping) is no
    // longer part of config.json - loaded separately via
    // telemetry_config_load() from /storage/telemetry.json. Any leftover
    // tlm0*/tlm1*/tlmBit* keys in an old config.json are simply ignored here
    // (config_from_json() already ignores unknown keys generally).

    set_str(c->http_username, sizeof(c->http_username), jget_str(d, "httpUser", def.http_username));
    set_str(c->http_password, sizeof(c->http_password), jget_str(d, "httpPass", def.http_password));
    {
        cJSON *p = cJSON_GetObjectItemCaseSensitive(d, "path");
        for (int i = 0; i < 4; i++) {
            cJSON *v = p ? cJSON_GetArrayItem(p, i) : NULL;
            set_str(c->path[i], sizeof(c->path[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.path[i]);
        }
    }

    // rfPTT (PTT GPIO) and rfPTTAct (PTT active-high) are not read back:
    // a config.json may still contain either key, but config_from_json()
    // ignores unknown keys, so both are simply skipped - the values come
    // from MODEM_PTT_GPIO / MODEM_PTT_ACTIVE_HIGH instead.

    if (!cJSON_GetObjectItemCaseSensitive(d, "msgEnable")) {
        // old-version file compatibility -> keep documented defaults
        c->msg_enable = true;
        c->msg_rf = true;
        c->msg_inet = true;
        c->msg_retry = 3;
        c->msg_interval = 30;
        c->msg_path = 9;
        set_str(c->msg_mycall, sizeof(c->msg_mycall), "NOCALL");
    } else {
        c->msg_enable = jget_bool(d, "msgEnable", def.msg_enable);
        c->msg_path = (uint8_t)jget_num(d, "msgPath", def.msg_path);
        c->msg_rf = jget_bool(d, "msgRf", def.msg_rf);
        c->msg_inet = jget_bool(d, "msgInet", def.msg_inet);
        c->msg_retry = (uint8_t)jget_num(d, "msgRetry", def.msg_retry);
        c->msg_interval = (uint16_t)jget_num(d, "msgInterval", def.msg_interval);
        set_str(c->msg_mycall, sizeof(c->msg_mycall), jget_str(d, "msgMycall", def.msg_mycall));
        c->msg_use_station = jget_bool(d, "msgUseStation", def.msg_use_station);
    }
    c->msg_alarm_enable = jget_bool(d, "msgAlarmEn", def.msg_alarm_enable);
    c->msg_alarm_gpio = (int8_t)jget_num(d, "msgAlarmGpio", def.msg_alarm_gpio);
    {
        cJSON *g = cJSON_GetObjectItemCaseSensitive(d, "msgGroup");
        for (int i = 0; i < 3; i++) {
            cJSON *v = g ? cJSON_GetArrayItem(g, i) : NULL;
            set_str(c->msg_group[i], sizeof(c->msg_group[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.msg_group[i]);
        }
    }

    c->query_en = jget_bool(d, "queryEn", def.query_en);
    c->query_rf = jget_bool(d, "queryRf", def.query_rf);
    c->query_inet = jget_bool(d, "queryInet", def.query_inet);
    c->query_aprs_en = jget_bool(d, "queryAprsEn", def.query_aprs_en);
    c->query_wx_en = jget_bool(d, "queryWxEn", def.query_wx_en);
    c->query_igate_en = jget_bool(d, "queryIgateEn", def.query_igate_en);
    c->query_directed_en = jget_bool(d, "queryDirectedEn", def.query_directed_en);
    c->query_ext_en = jget_bool(d, "queryExtEn", def.query_ext_en);
    c->query_min_interval_sec = (uint16_t)jget_num(d, "queryMinInterval", def.query_min_interval_sec);
    if (c->query_min_interval_sec < 5) // floor: airtime/loop safety, matches the webconfig page's own clamp
        c->query_min_interval_sec = 5;
    c->query_cap_beacon_en = jget_bool(d, "queryCapEn", def.query_cap_beacon_en);
    {
        int iv = (int)jget_num(d, "queryCapIntv", def.query_cap_interval_sec);
        if (iv < QUERY_CAP_INTERVAL_S_MIN || iv > QUERY_CAP_INTERVAL_S_MAX) {
            int clamped = (iv < QUERY_CAP_INTERVAL_S_MIN) ? QUERY_CAP_INTERVAL_S_MIN : QUERY_CAP_INTERVAL_S_MAX;
            ESP_LOGW(TAG, "queryCapIntv %d out of range, clamped to %d", iv, clamped);
            iv = clamped;
        }
        c->query_cap_interval_sec = (uint32_t)iv;
    }
    c->query_cap_rf = jget_bool(d, "queryCapRf", def.query_cap_rf);
    c->query_cap_inet = jget_bool(d, "queryCapInet", def.query_cap_inet);
    set_str_utf8(c->query_cap_extra, sizeof(c->query_cap_extra), jget_str(d, "queryCapExtra", def.query_cap_extra));
    app_config_query_cap_extra_sanitize(c->query_cap_extra);
}

bool app_config_save(void) {
    // Streams the configuration straight to the file, one field at a time -
    // see the note on the JSON writer above for why no in-RAM document is
    // built.
    //
    // Serialize the whole save against any other save/load in flight (see
    // s_config_mutex comment above). Block indefinitely: a save must never
    // be silently dropped, and the critical section below is short.
    //
    // The handle is taken once and reused for the rest of the function, so the
    // stream handed out by json_store_open_tmp() is checked against the very
    // mutex this task holds.
    SemaphoreHandle_t lock = config_mutex();
    if (!lock) {
        ESP_LOGE(TAG, "save mutex unavailable (out of memory), configuration not written");
        return false;
    }
    xSemaphoreTake(lock, portMAX_DELAY);

